/* 
  Localizable.strings
  ownCloudSDK

  Created by Felix Schwarz on 03.03.18.
  Copyright © 2018 ownCloud GmbH. All rights reserved.
*/

/* Item property names */
"itemProperty.lastModified" = "最後修改";
"itemProperty.isFavorite" = "我的最愛";
"itemProperty.localAttributes" = "本地端屬性";

/* Connection Progress */
"Connecting…" = "正在連接…";
"Authenticating…" = "正在驗證...";
"Error" = "錯誤";
"Fetching user information…" = "正在獲取使用者信息…";
"Connected" = "已連線";

"Retrieving thumbnail…" = "正在檢索縮圖...";

"Cancel" = "取消";
"Proceed" = "已執行";
"OK" = "確定";

/* Connection status */
"Offline" = "下線";
"Offline (no WiFi connection)" = "離線（無WiFi連接）";
"Server down for maintenance" = "伺服器由於維護原因而關閉";
"Online" = "線上";

/* Delete */
"%@ changed on the server. Really delete it?" = "%@在伺服器上更改。 真的刪除了嗎？";
"%@ has changed on the server since you requested its deletion." = "%@ 自您請求刪除伺服器以來，該服務器上的服務器已更改。";
"Delete" = "刪除";

"%@ couldn't be deleted" = "%@ 無法刪除";
"Please check if you have sufficient permissions to delete %@." = "請檢查您是否有足夠的權限刪除%@";

/* Copy / Move */
"Operation forbidden" = "禁止操作";
"%@ can't be copied to %@." = "%@ 無法複製到 %@";
"%@ can't be moved to %@." = "%@無法移至%@";

"%@ not found" = "%@ 未找到";
"%@ wasn't found at %@." = "%@在找不到%@";

"The target directory %@ doesn't seem to exist." = "目標資料夾%@似乎不存在。";

"%@ already exists" = "%@已經存在";
"Couldn't copy %@ to %@, because an item called %@ already exists there." = "Couldn't copy %@ to %@, because an item called %@ already exists there.";
"Couldn't move %@ to %@, because an item called %@ already exists there." = "不能移動 %@至%@，因為項目叫%@ 已經在那裡。";

"Insufficient permissions" = "權限不足";
"%@ can't be copied to %@." = "%@ 無法複製到 %@";
"%@ can't be moved to %@." = "%@無法移至%@";

"%@ not found on the server" = "%@ 在伺服器上找不到";
"%@ may have been renamed, moved or deleted remotely." = "%@ 可能已被遠程重命名，移動或刪除。";

"Error copying %@" = "錯誤複製%@";
"Error moving %@" = "移動錯誤 %@";

/* Download */
"Downloading %@…" = "正在下載%@...";

/* Move/Rename/Copy */
"Renaming %@ to %@…" = "重命名%@到%@...";
"Moving %@ to %@…" = "移動%@到%@...";
"Copying %@ to %@…" = "複製%@到%@...";

/* Create folder */
"Creating folder %@…" = "創造目錄%@...";

/* Delete */
"Deleting %@…" = "刪除%@...";

/* Retrieving file list */
"Retrieving file list for %@…" = "正在檢索檔案列表 %@...";

/* Update */
"\"%@\" metadata for %@ couldn't be updated" = "\"%@\" metadata for %@ couldn't be updated";
"Update failed with status code %d" = "更新與失敗，顯示狀態碼%d";
"Error updating %@ metadata" = "錯誤更新中%@元數據";

/* Logging */
"Standard error output" = "標準錯誤輸出";
"Log file" = "記錄檔";

/* Errors */
"Server doesn't seem to support any authentication method supported by this app." = "伺服器似乎不支持此軟體支持的任何身份驗證方法。";
"This server runs an unsupported version (%@). Version %@ or later is required by this app." = "This server runs an unsupported version (%@). Version %@ or later is required by this app.";

/* DAV Errors */
// OCDAVErrorServiceUnavailable
"Server down for maintenance." = "伺服器停機以進行維護。";

/* OC Errors */
"%@ (error %ld, %@)" = "%@(錯誤 %ld,%@)";
"%@ (error %ld)" = "%@(錯誤 %ld)";

// OCErrorInternal
"Internal error." = "內部錯誤";

// OCErrorInsufficientParameters
"Insufficient parameters." = "參數不足。";

// OCErrorAuthorizationFailed
"Authorization failed." = "授權失敗了。";

// OCErrorAuthorizationRedirect
"Authorization failed because the server returned a redirect. Authorization may be successful when retried with the redirect URL." = "Authorization failed because the server returned a redirect. Authorization may be successful when retried with the redirect URL.";

// OCErrorAuthorizationNoMethodData
"Authorization failed because no secret data was set for the authentication method." = "授權失敗，因為未為身份驗證方法設置任何秘密數據。";

// OCErrorAuthorizationMissingData
"Authorization failed because data was missing from the secret data for the authentication method." = "授權失敗，因為身份驗證方法的機密數據中缺少數據。";

// OCErrroAuthorizationCancelled
"Authorization was cancelled by the user." = "使用者取消了授權。";

// OCErrorRequestURLSessionTaskConstructionFailed
"Construction of URL Session Task failed." = "超連結會話任務的構建失敗。";

// OCErrorNewerVersionExists
"A newer version already exists." = "已存在較新的版本。";

// OCErrorRequestCancelled
"Request was cancelled." = "請求已取消。";

// OCErrorRequestRemovedBeforeScheduling
"Request was removed before scheduling." = "計劃之前已移除請求。";

// OCErrorRequestServerCertificateRejected
"Request was cancelled because the server certificate was rejected." = "由於伺服器憑證被拒絕，因此請求被取消。";

// OCErrorRequestDroppedByURLSession
"Request was dropped by the NSURLSession." = "NSURLSession刪除了請求。";

// OCErrorRequestCompletedWithError
"Request completed with error." = "請求已完成，與有錯誤。";

// OCErrorRequestURLSessionInvalidated
"Request couldn't be scheduled because the underlying URL session has been invalidated." = "由於基礎超連結會話已無效的，因此無法安排請求。";

// OCErrorException
"An exception occured." = "發生異常。";

// OCErrorResponseUnknownFormat
"Response was in an unknown format." = "回應不明格式.";

// OCErrorServerDetectionFailed
"Server detection failed, i.e. when the server at a URL is not an ownCloud instance." = "伺服器檢測失敗，即，超連結處的伺服器不是ownCloud實體。";

// OCErrorServerTooManyRedirects
"Server detection failed because of too many redirects." = "伺服器檢測由於重定向過多而失敗。";

// OCErrorServerBadRedirection
"Server redirection to bad/invalid URL." = "伺服器重定向到錯誤/無效的超連結";

// OCErrorServerVersionNotSupported
"This server version is not supported." = "不支持此伺服器版本。";

// OCErrorServerNoSupportedAuthMethods
"Server doesn't seem to support any authentication method supported by this app." = "伺服器似乎不支持此軟體支持的任何身份驗證方法。";

// OCErrorCertificateInvalid
"The certificate is invalid or contains errors" = "憑證無效的或包含錯誤";

// OCErrorCertificateMissing
"No certificate was returned for a request despite this being a HTTPS connection (should never occur in production, but only if you forgot to provide a certificate during simulated responses to HTTPS requests)." = "儘管這是HTTPS連接，但沒有為請求返回憑證（在生產環境中永遠不會發生，只有在模擬對HTTPS請求的響應過程中忘記提供憑證的情況下，才應該出現）。";

// OCErrorFeatureNotSupportedForItem
"This feature is not supported for this item." = "此項目不支持此功能。";

// OCErrorFeatureNotSupportedByServer
"This feature is not supported for this server (version)." = "該伺服器不支持此功能(version).";

// OCErrorFeatureNotImplemented
"This feature is currently not implemented" = "目前尚未實現此功能";

// OCErrorItemNotFound
"The targeted item has not been found." = "找不到目標項目。";

// OCErrorItemDestinationNotFound
"The destination item has not been found." = "找不到目標項目。";

// OCErrorItemChanged
"The targeted item has changed." = "目標項目已更改。";

// OCErrorItemInsufficientPermissions
"The action couldn't be performed on the targeted item because the client lacks permissions." = "由於客戶端缺少權限，因此無法對目標項目執行操作。";

// OCErrorItemOperationForbidden
"The operation on the targeted item is not allowed." = "不允許對目標項目進行操作。";

// OCErrorItemAlreadyExists
"There already is an item at the destination of this action." = "此操作的目的地已經有一個項目。";

// OCErrorItemNotAvailableOffline
"Item not available offline." = "項目無法離線可用的。";

// OCErrorFileNotFound:
"File not found." = "檔案未找到。";

// OCErrorCancelled
"The operation was cancelled." = "操作被取消。";

// OCErrorOutdatedCache
"An operation failed due to outdated cache information." = "由於快取信息過時，操作失敗。";

// OCErrorRunningOperation
"A running operation prevents execution." = "正在運行的操作會阻止執行。";
